clc, clear all;

A = [6.9000 0.0319 0.0390 0.0461;...
    0.0191 6.0000 0.0333 0.0405;...
    0.0134 0.0205 5.1000 0.0348;...
    0.0077 0.0149 0.0220 4.2000];

b = [5.6632;
    6.1119;
    6.2000;
    5.9275];

% точность численного решения
e = 1e-8;

disp("Дано уравнение AX=B, где");
disp("Матрица А");
disp(A);
disp("Матрица В");
disp(b);

%_____________Метод простых итераций______________

% приводим к нужному виду:
AB = [A b];
for i = 1:size(A) % причесываем
    a(i,1:4) = -AB(i,1:4)/AB(i,i);
    a(i,i) = 0;
    k(i,1) = AB(i,5)/AB(i,i);
end

% Задание начального приближения
X0 = k; 
X1 = a*X0+k;

while norm(X1-X0) >= e
    X0 = X1;
    X1 = a*X0+k;
end;

X = X1;
disp("Решение методом простых итераций: ");
disp("X = ");
disp(X);

%_____________Метод Якоби______________
X0 = b;   

c = A*X0 - b;

while c >= e
    
    x1 = (b (1,1) - A (1,2) *X0(2) - A (1,3) *X0(3) - A (1,4) *X0(4)) /A(1,1);
    x2 = (b (2,1) - A (2,1) *X0(1) - A (2,3) *X0(3) - A (2,4) *X0(4)) /A(2,2);
    x3 = (b (3,1) - A (3,1) *X0(1) - A (3,2) *X0(2) - A (3,4) *X0(4)) /A(3,3);
    x4 = (b (4,1) - A (4,1) *X0(1) - A (4,2) *X0(2) - A (4,3) *X0(3)) /A(4,4);
    
    X0 = [x1;x2;x3;x4];
    c = norm(A*X0 - b);
    
end;

disp("Решение методом Якоби: ");
disp("X = ");
disp(X0);

%_____________Метод Зейделя____________

%Начальные приближения

x1 = b (1,1) /A (1,1);
x2 = b (2,1) /A (2,2);
x3 = b (3,1) /A (3,3);
x4 = b(4,1) /A (4,4);

m = max (abs (x1),abs (x2));
m = max (m,abs (x3));
m = max (m,abs (x4));

%Итерации

while m > e

X (1,1) = x1;
X (1,2) = x2;
X (1,3) = x3;
X (1,4) = x4;

x1 = ((b (1,1) - A (1,2) *x2 - A (1,3) *x3 - A (1,4) *x4) /A (1,1));
x2 = ((b (2,1) - A (2,1) *x1 - A (2,3) *x3 - A (2,4) *x4) /A (2,2));
x3 = ((b (3,1) - A (3,1) *x1 - A (3,2) *x2 - A (3,4) *x4) /A (3,3));
x4 = ((b (4,1) - A (4,1) *x1 - A (4,2) *x2 - A (4,3) *x3) /A (4,4));

X (2,1) = (x1 - X(1,1));
X (2,2) = (x2 - X(1,2));
X (2,3) = (x3 - X(1,3));
X (2,4) = (x4 - X(1,4));

m = max (abs (X (2,1)), abs (X (2,2)));
m = max (m, abs (X (2,3)));
m = max (m, abs (X (2,4)));

end;

disp("Решение методом Зейделя: ");
disp("X = ");
disp ([x1 x2 x3 x4])

%Проверка
X =A\b;
disp("Проверка корней встроенной функцией MatLab: ");
disp(X);