clc, clear;
format short;
A = [6 5 -2 4; 9 -1 4 -1; 3 4 2 -2; 3 -9 2 0];
B = [-4; 13; 1; 11];

if det(A)== 0
    disp('Определитель 0');
end

disp('Исходная матрица A:');
disp(A);

disp('Исходная матрица B:')
disp(B);

disp('Первый способ с помощью обратной матрицы:');
X1 = A^-1*B;
disp(X1);

disp('Второй способ с помощью функции inv(A):');
X2 = inv(A)*B;
disp(X2);

disp('Третий способ с помощью встроенного оператора:');
X3 = mldivide(A,B);
disp(X3);

disp('Четвертый способ с помощью метода Крамера:');
A1 = A;
A2 = A;
A3 = A;
A4 = A;
A1(:,1) = B;
A2(:,2) = B;
A3(:,3) = B;
A4(:,4) = B; 
x1 = det(A1) / det(A);
x2 = det(A2) / det(A);
x3 = det(A3) / det(A);
x4 = det(A4) / det(A);
X4 = [x1;x2;x3;x4];
disp(X4);

disp('Пятый способ с помощью метода Гаусса:');
C = [A B];
X5 = rref(C);
X5 = X5(:,5);
disp(X5);

disp('Шестой способ с помощью LU разложения:');
[L,U] = lu(A);
y = L\B;
X6 = U\y;
disp(X6);
k = A*X6;
disp('Проверка:');
disp(k);

disp('Седьмой способ с помощью QR разложения:');
[Q,R] = qr(A);
X7 = R\(Q'*B);
disp(X7);
l=A*X7;
disp('Проверка:');
disp(l);